export const MOMENTS_TAGS = [
    "吃饭", "模玩", "炉石", "旅行", "生活", "感悟", "数学"
];

export const MOMENTS = [
    {
        "id": "59fd4def-5ed8-43ec-9514-b3c9808993f5",
        "title": "西贡游一游",
        "tags": [ "旅行" ],
        "date": "2022-4-17",
        "images": [
            "xigong-1.jpeg",
            "xigong-2.jpeg",
            "xigong-3.jpeg",
            "xigong-5.jpeg",
            "xigong-4.jpeg",
            "xigong-6.jpeg"
        ],
        "content": "今天的阳光真不灿烂, 没事出来转一转. 肚子饿得直叫唤, 然后去了海底捞.\n\n(图三那个大哥是怎么上去的...)"
    },

    {
        "id": "fd8e642b-bd00-4ec7-94f3-e03b0445a256",
        "title": "鸡汤 - 认识困难",
        "tags": [ "感悟" ],
        "date": "2022-4-17",
        "images": [],
        "content": "没有人是完美的, 每个人都有自己的优缺点. 对于我来说, 一个做的很不好的事情就是: 不会正确地面对困难. \n\n具体一点, 首先定义一下什么是困难: 第一种, 因为难度很大而停滞不前的难题; 第二种, 是不在计划内的事情; 第三种, 是内心很抵触的事情. 其实一直以来都没有认真地分析过, 最近静下心来认真思考, 才对这些困难有一个更加清晰的认识. \n\n对于第一种, 往往发生在学习生活上, 而我的一贯做法就是摆烂. 写到这里, 就回想起上初中的时候, 当时的数学考试的最后两题往往都是难题, 没有一点钻研精神一般是很难解出来的. 在很长一段时间内, 我就选择放弃它们了, 因此数学的分数一直处在一个不高不低的状态. 所幸后来有意识到这个问题, 于是花时间攻克难题. 那么实际的情况是: 它们是能够被解出来的, 当然这需要大量的练习和思考, 不是一个容易的过程. 所以对于第一种困难, 一定要调整好心态, 做好花长时间的心里准备. 值得注意的是能够突破难题是十分重要的, 因为这是就是够和其他人拉开差距的地方.\n\n第二种困难就是不在计划中的事情. 在疫情时代, 这种困难愈加频繁. 而我认为的正确方式就是要及时地作出计划的变动. 因此, 在未来做计划时, 要做到灵活变通, 留有后路. 最重要的, 还是要学会面向未来思考. 虽然都说谋事在人, 成事在天, 但还是得 \"谋\" 啊.\n\n最后一种困难就是那些心里很抵触的事情. 遇到这种事情就要理性思考, 不要被情绪牵着走. 仔细分析利弊后再采取行动. \n\n除了这些以外, 还要注意以下几点: 1. 不要害怕失败, 没有失败就没有成长. 2. 一件事情, 不管成功或是失败, 都要分析导致最终结果的原因, 尤其是成功的原因, 因为教训只能教会你什么事情不要做, 而成功则会教会你做出正确的选择."
    },

    {
        "id": "e6dae635-bd60-4807-8a35-59808ecc4aa0",
        "title": "这个学期真的累!",
        "tags": [ "生活" ],
        "date": "2022-4-10",
        "images": [ "timetable.png", "reaper.jpeg" ],
        "content": "死神说得好, 没能杀死你的东西，只会让你更强大."
    },

    {
        "id": "bd59be6d-7431-4d56-b0a2-2e2224f79e93",
        "title": "吃鸡! 爽!",
        "tags": [ "炉石" ],
        "date": "2022-4-3",
        "images": [ "奥秘哥吃鸡.png" ],
        "content": "虽然看起来似乎没什么, 但是其实在冰箱被破之后依然坚持了六个回合, 最终吃鸡! (三家鱼, 有一家金小黄, 鱼平均100+血.)"
    },

    {
        "id": "c26935ae-ed69-4bba-b64c-f6623963a904",
        "title": "数学太难",
        "tags": ["数学"],
        "date": "2022-3-31",
        "images": ['math-is-easy.jpeg'],
        "content": "啥也不说了. 脑子不够用别选重数学的学科."
    },

    {
        "id": "86802ef4-4f3c-4ac7-9953-fcd992b90b69",
        "title": "居然想去种稻子了",
        "tags": [],
        "date": "2022-3-30",
        "images": ['种田.jpeg'],
        "content": "看了一个种稻子的视频, 好治愈!\n\n视频链接: https://youtu.be/Wqu2WeZlv2E\n\n(想去种田了怎么办?)"
    },

    {
        "id": "b6618c1b-cf34-4dbd-81e7-1fe5466023a3",
        "title": "为什么要读书",
        "tags": [ "感悟" ],
        "date": "2022-3-30",
        "images": [],
        "content": "读书其实不是仅仅为了学习书本上的知识，而是为了学习如何想方设法的去攻克学习生活中遇到的一个个难题。在这个过程中，我们知道了怎样去更加高效的学习，如何与同学老师有效地沟通，我们磨练了自己的意志，遇到困难不退缩，遇到难点会钻研，遇到诱惑能克制… 最终，一个优秀的成绩就是你做到这些这些的最好证明，而绝非仅仅是你在某些学科上的获取的成就。"
    },

    {
        "id": "4bca0d3f-744c-4c22-ba02-06e7dd9d0187",
        "title": "怎么学数学",
        "tags": [ "感悟" ],
        "date": "2022-03-30",
        "images": [],
        "content": "学数学, 一定要先把中心思想搞明白. 换句话说就是能用语自己的话描述整个运作的过程及基本原理. 然后再仔细研究那些是复杂的数学公式."
    },

    {
        "id": "d231b0d0-2256-4c0b-8fe2-3ff8ad19bc95",
        "title": "下雨天的狮子山",
        "tags": [ "生活" ],
        "date": "2022-03-29",
        "images": [ "雨天狮子山.jpeg" ],
        "content": "春季, 雨天, 白色, 绿色.\n\n太好看了哇!"
    },

    {
        "id": "1ef89eb9-5c19-4a2a-8983-602eaab8bfde",
        "title": "RG沙扎比骨架",
        "tags": [ "模玩" ],
        "date": "2022-03-29",
        "images": [ "rg沙扎比骨架1.jpeg", "rg沙扎比骨架2.jpeg", "rg沙扎比骨架3.jpeg" ],
        "content": "经过若干天的组装, 终于把 RG 沙扎比的骨架完成了! 拍照留念一下"
    },

    {
        id: `9decef88-0c28-4b7b-93a2-14b37ee077f0`,
        title: "鸡汤",
        date: "2022-3-22",
        tags: ["生活"],
        images: [],
        content: "“If You Fail to Plan, You Are Planning to Fail” — Benjamin Franklin"
    },

    {
        id: `e75cf4c2-d408-4d5e-8f70-e2e23751fb53`,
        title: "强化学习考试给我整傻了",
        date: "2022-3-19",
        tags: ["生活"],
        images: ['麻了.jpeg','麻中麻.jpeg','麻中麻中麻.jpeg'],
        content: "五个题目, 的基本都不会, 还要写代码..."
    },

    {
        id: `d1424ea2-1543-4fff-89d7-f4fa74529c2c`,
        title: "闭卷考试真恐怖",
        date: "2022-3-14",
        tags: ["生活"],
        images: ['sad_cat.jpeg'],
        content: "因为最近有一场很难的闭卷考试, 压力好大.\n昨天晚上居然还因此做噩梦了...\n梦见在准备考试, 然后掏出一本很厚很厚的书在看...\n再然后梦见考的时候一点都不会...\n\n\n裂开了...\n"
    },

    {
        id: `62fe77b4-a1db-420c-863e-39e561c77fec`,
        title: "天冷了, 整点煎饺吃",
        date: "2022-2-21",
        tags: ["吃饭"],
        images: ['煎饺1.jpeg', '煎饺2.jpeg', '煎饺3.jpeg'],
        content: "煎饺心得: 加水之前别煎地太过, 一点点金黄就可以了, 脆脆效果留在水烧干以后完成!"
    },

    {
        id: 'daded88e-d32c-4c82-b700-c1791de35c01',
        title: "卡版零式飞翼上支架",
        date: "2022-2-13",
        tags: ["模玩"],
        images: ['零式飞翼(支架).jpeg', '零式飞翼局部(支架).jpeg'],
        content: "组装好已经很久了, 但是一直没有做支架. 今天心血来潮就把支架给做了, 效果很不错啊.\n帅就完事了!!!"
    },

    {
        id: '6b25cb2c-e857-457d-bec9-c2a7d0c2d702',
        title: "卡版零式飞翼水贴",
        date: "2022-2-12",
        tags: ["模玩"],
        images: ['飞翼高达.jpeg'],
        content: "贴水贴虽然麻烦, 但是效果很治愈!\n赞啦!!\n\n手臂以及一些其他的就留给下次吧!"
    },

    {
        id: '88d28f5f-1fa5-43ed-93c1-6072e2145743',
        title: "今日份快乐",
        date: "2022-2-9",
        tags: ["炉石", "吃饭"],
        images: ['pizza-20220209.jpeg', '野兽吃鸡20220209.jpeg'],
        content: "今日伙食: 夏威夷厚批 + 鸡翅 + 小香肠.\n天胡野兽吃鸡, 太爽啦!!!"
    },

    {
        id: '10c58331-5fb9-41d5-9946-435acdecb06d',
        title: "长洲岛",
        date: "2022-2-5",
        tags: ["旅行"],
        images: ["changzhou1.jpeg", "changzhou2.jpeg", "changzhou3.jpeg", "changzhou4.jpeg", "changzhou5.jpeg", "changzhou6.jpeg", "changzhou7.jpeg", "changzhou8.jpeg", "changzhou9.jpeg", ],
        content: "初五长洲岛."
    }
]
